import { FAQ } from '@/types/tour';

export const faqs: FAQ[] = [
  {
    question: 'Как записаться на экскурсию?',
    answer:
      'Чтобы записаться на экскурсию, присылайте заявки на мой почтовый адрес tatiana.city.guide@gmail.com или на мой номер 512-801-4114',
  },
  {
    question: 'Как оплатить экскурсию?',
    answer: 'Оплатить можно через Venmo, Zelle или перед началом экскурсии!',
  },
  {
    question: 'Что делать, если я не успеваю к началу экскурсии?',
    answer:
      'Позвоните мне! Постарайтесь сообщить об этом до начала экскурсии. Даже если экскурсия уже началась, я по возможности вам отвечу, и объясню как нас найти.',
  },
  {
    question: 'Я не могу найти место встречи!',
    answer: 'Позвоните мне!',
  },
  {
    question: 'Я беспокоюсь из-за погоды',
    answer:
      'Если погода не позволяет провести пешеходную экскурсию (экстремальная жара, шторм, ливень), мы перенесем ее на другое время, удобное всем. Если такой неблагоприятный прогноз будет известен заранее, я сообщу об этом всем записавшимся.',
  },
  {
    question:
      'Хочу прийти с друзьями или родственниками, но они плохо понимают русский язык',
    answer: 'Приходите, но переводить всю информацию придется вам.',
  },
  {
    question: 'Я хочу заказать индивидуальную экскурсию',
    answer: 'Это возможно под заказ, позвоните мне.',
  },
];
